In [1]:
import pandas as pd
from pathlib import Path

In [2]:
#selective relative path
csvpath = Path("../02_Fix_Column_Headers/sales_no_header.csv")

In [4]:
# use pandas "read_csv function", add "header=none" to auto add header
#sales_data = pd.read_csv(csvpath)

sales_data = pd.read_csv(csvpath, header=None)
sales_data.head()

                 0                       1      2       3
0    Elwanda White      alyre2036@live.com   9236   84.33
1   Lyndon Elliott  arrowy1873@outlook.com   1330  879.95
2   Daisey Sellers  toucan2024@outlook.com   7631  907.58
3     Issac Reeves    asarin1958@gmail.com  81168  545.88
4  Bradford Kinney  mibound1801@yandex.com  41721  517.49

In [5]:
# add column names

columns = ["Full Name", "Email", "Zip Code", "Sale Price"]
sales_data.columns = columns
sales_data.head()

         Full Name                   Email  Zip Code  Sale Price
0    Elwanda White      alyre2036@live.com      9236       84.33
1   Lyndon Elliott  arrowy1873@outlook.com      1330      879.95
2   Daisey Sellers  toucan2024@outlook.com      7631      907.58
3     Issac Reeves    asarin1958@gmail.com     81168      545.88
4  Bradford Kinney  mibound1801@yandex.com     41721      517.49

In [ ]:
#renaming columns
# {
#    "Old Column Name": "New Column Name"
# }

sales_data = sales_data.rename(columns={
    "Credit Card Number": "Credit Card"
})

sales_data.head()